case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     multiRegionPhaseChangeFlow;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         100e-3;

deltaT          1e-9;

writeControl    adjustableRunTime;

writeInterval   5e-3;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression on;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.9;
maxAlphaCo      0.9;
maxDeltaT       1;
maxDi           500;
maxCapillaryNum 1;

libs
(
    "libpostProcess.so"
    "libfluidThermo.so"
    //"libdynamicLoadBalanceFvMesh.so"        // All AMR and LB enhancements
);

functions
{

    intPsi
    {
        type            fieldIntegrate;
        functionObjectLibs ("libpostProcess.so");

        // Write at same frequency as fields
        writeControl    timeStep;
        writeInterval   1;
        region fluid;
        field psi0_;
    }

}

// ************************************************************************* //
