case/0.orig/fluid/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
  top
  {
      type            inletOutlet;
      inletValue      uniform 1;
      value           uniform 1;
      
  }


 // bottom
 //  {
 //      type zeroGradient;
 //  }

  bottom
  {
        type           constantAlphaContactAngle;
        theta0         38;
        limit          gradient;
        //value          uniform 0;
  }

  outlet
  {
    type zeroGradient;
  }
  sym
  {
    type symmetry;
  }

}

// ************************************************************************* //
